SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-46106-A

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
	WagonShape ( DEE_RS_46106.s )
	Size  ( 2.75421m 4.02359m 12.2m )
Mass ( 83t-uk )
WheelRadius ( 19.75in )comment (Front Bogie)

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Break ( 710kN 1220kN )
			r0 ( 10cm 0cm )
		)
		CouplingHasRigidConnection (1)
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
Comment ( * Locomotive is steam braked * )
BrakeEquipmentType( "Vacuum_brake, Auxilary_reservoir" )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 227kN ) Comment ( * braked approx 70% of mass on driving wheels, or 55% of Weight in Working Order, coefficient of friction 0.5 * )

MaxReleaseRate ( 2.5inHg/s ) 
MaxApplicationRate ( 2.0inHg/s )

ORTSBrakeCylinderSize ( 6in ) Comment ( Locomotive has steam brake  )
ORTSAuxilaryResCapacity ( 0.90ft^3 ) Comment ( Vacuum reservoir used for control of steam brake )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.7m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 15.0ft 4.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 6491 )
ORTSDavis_B ( 27.75 )
ORTSDavis_C ( 5.502 )

ORTSWagonFrontalArea (103)
ORTSDavisDragConstant (0.0034)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights	( 6
			Light	(
			comment( Front White Lamp Position B )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
   					Position ( 0.96 1.54 5.69 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.55 )
					)
				)
			)
			Light	(
			comment( Front White Lamp Position D )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
   					Position ( -0.96 1.54 5.69 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.55 )
					)
				)
			)
  Light ( 
   comment( Gauge glass Lamp )
   Type ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( 80ffe610 )
   Position ( 0.17 3.3 -4.7550 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 0.35 )
     )
    )
   )
  Light (
   comment( Flickering firebox )
   Type  ( 0 )
   Conditions (
   Headlight ( 0 )
   Unit ( 0 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( -0 2.242 -4.72 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.4 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ffe610 )
   Position ( -0 2.242 -4.72 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.4 )
         
     )
    )
   )
			Light	(
			comment( flickering fire underneath LHS )
				Type		( 0 )
				Conditions	(
				Headlight ( 0 )
				TimeOfDay ( 2 )
				Unit ( 0 )
			)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle ( 0 )
				States	(	4
					State	(
						Duration ( 0.02 )
						LightColour ( aaffa200 )
						Position ( -0.5 0.7 -3.7 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 3 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffae00 )
						Position (-0.5 0.7 -3.7)
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 1 )
						)
					State	(
						Duration ( 0.03 )
						LightColour ( aaffa900 )
						Position (-0.5 0.7 -3.7 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 2 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffa000 )
						Position (-0.5 0.7 -3.7 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 4 )									)
				)
			)

		Light	(
			comment( flickering fire underneath RHS )
				Type		( 0 )
				Conditions	(
				Headlight ( 0 )
				TimeOfDay ( 2 )
				Unit ( 0 )
			)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle ( 0 )
				States	(	4
					State	(
						Duration ( 0.02 )
						LightColour ( aaffa200 )
						Position ( 0.5 0.7 -3.7 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 3 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffae00 )
						Position (0.5 0.7 -3.7)
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 3 )
						)
					State	(
						Duration ( 0.03 )
						LightColour ( aaffa900 )
						Position (0.5 0.7 -3.7 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 2 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffa000 )
						Position (0.5 0.7 -3.7 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 4 )									)
					)
				)
			)
		
Comment( ******* Miscellaneous Wagon Information************ )
	
	FreightAnim (RScotextras5.s 1.0 3.0 1.0)

Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( DEE_RS_46106.s )
        PassengerCabinHeadPos ( 1.423 3.2 -4.2 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound ("..\\..\\Common.Steam\\PatriotSound\\Patrioteng.sms" )
)

Engine ( OR-46106-A

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

   			WhistleFX
   			(
    			0 3.9 -3.86
    			0 0 1
    			0.2
   			)
   			SafetyValvesFX
   			(
    			0 3.99 -2.9
    			0 1 0
    			0.4
   			)
   			StackFX
   			(
    			0 4.1 3.7
    			0 1 0
    			0.32
   			)

			DrainpipeFX
   			(
			-1.5 1.258 -3.886
			-0.4 -1 -0.2
			0.1
			)
			
			Injectors2FX
			(
				-1.1 1 -5
				0 -1 0
				0.15
			)
			Injectors1FX
			(
				1.1 1 -5
				0 -1 0
				0.15
			)
   			CylindersFX
   			(
    			-1.3 0.5 4.3
    			0 -0.325 1
    			0.25
   			)

   			CylindersFX
   			(
    			1.3 0.5 4.3
    			0 -0.325 1
    			0.25
   		)
  	)
 )

Wagon ( OR-46106-A )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 40.5in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 61t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 244ft^3 )  
ORTSEvaporationArea ( 1851ft^2 )
ORTSSuperheatArea ( 367ft^2 )
MaxBoilerPressure ( 250psi )
MaxSteamHeatingPressure ( 80psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 3 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 18in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13800btu/lb )comment(South Kirkby Coal)
ORTSGrateArea ( 31.25ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ****************** Fuel ************************* )

MaxTenderCoalMass ( 9t-uk )
MaxTenderWaterMass ( 40000lb )
IsTenderRequired( 1 )	

ORTSWaterScoopFillElevation ( 2.8m )
ORTSWaterScoopDepth ( 3.0in ) Comment (* LNER standard scoop - depth varies depending on trough and area of operation *)
ORTSWaterScoopWidth ( 10.875in )


Comment(       ********ADVANCED PARAMETERS**********      )

ORTSBoilerEvaporationRate ( 17 )   
Comment(Set to acheive max steaming rate for 2A Stanier Boiler with Double Chimney)

Comment(ORTSMaxIndicatedHorsepower ( 1770.0hp ))   

ORTSMaxSuperheatTemperature ( 250.0 )   
Comment(From Graph 17)

ORTSBoilerEfficiency( 0.0 0.94  198.0 0.47 )   
Comment(Estimated)

ORTSBurnRate( 0.0 10.0  9000.0 1000.0  15750.0 2000.0  18000.0 2500.0  20500.0 3000.0  23000.0 4000.0  25000.0 5000.0 25500.0  7000.0 )   Comment(From Graph 18)

    
Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
BrakesEngineBrakeType ( "Steam_brake" )Comment(steam_brake crahes OR in Brake HUD)
TrainPipeLeakRate ( 0.05inHg/s )


Comment ( *** Ejectors *** )
Comment (  Estimate for Gresham & Craven SJ type P ejector  )
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.34inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 210lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 110psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakePipeTimeFactor ( 0.02s )
ORTSBrakeServiceTimeFactor ( 10.0s )


Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Comment ( Locomotive brake based upon Gresham & Craven MkIV Steam Brake Valve )
Brake_Engine ( 0 1 0.25 0.0
NumNotches( 5
Notch( 0.00 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.25 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.50 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.75 0 EngineBrakesControllerBrakeNotchStart )
Notch( 1.00 0 EngineBrakesControllerBrakeNotchStart ) ) )


Comment ( Based upon Gresham & Craven SJ Ejector and control valve )
Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )

ORTSSmallEjector ( 0 1 0.1 1.0 NumNotches ( 0 ) )

FireDoor ( 0 1 0.1 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( Patriot.cvf )
HeadOut (  -1.423 3.2 -4.2 )
Sound ("..\\..\\Common.Steam\\PatriotSound\\Patriotcab.sms" )
Name ( "46106 Rebuilt Scot GORDON HIGHLANDER, Class A, Shed 8A Edge Hill, TE 33.15Klbf" )
Description (
"The London, Midland and Scottish Railway (LMS) Royal Scot Class is a class of 4-6-0 express passenger locomotive introduced in 1927. Originally having parallel boilers, all members were later rebuilt with tapered type 2A boilers, and were in effect two classes.

Until the mid-1920s, the LMS had followed the Midland Railway's small engine policy, which meant that it had no locomotives of sufficient power for its expresses on the West Coast Main Line. These trains were entrusted to pairs of LMS/MR Midland Compound 4-4-0s between Glasgow and Carnforth, and a 4-6-0 locomotive of the LNWR Claughton Class, piloted by an LNWR George V 4-4-0, southwards to Euston station.

The Operating and Motive Power Departments of the LMS were satisfied with the small engine policy. However, in 1926 the Chief Mechanical Engineer, Henry Fowler, began the design of a compound Pacific express locomotive. The management of the LMS, faced with disagreement between the CME and the other departments, obtained a loan of a GWR Castle class locomotive, Launceston Castle, which was operated for one month between Euston and Carlisle.

The London, Midland and Scottish Railway (LMS) Rebuilt Royal Scot Class is a class of 4-6-0 steam locomotives. 70 members of this class were rebuilt by the LMS and its successor British Railways (BR) from LMS Royal Scot Class engines by the replacement of their life expired parallel boilers with a type 2A boiler over the period 1943–1955. (The class sometimes is numbered 71 as it included a prototype 1935 rebuild LMS 46170 British Legion, but sufficient technical differences existed which dictate that it is treated separately). They were the second type of LMS 2 and 2A boilered 4-6-0 locomotives, after the rebuild of British Legion and the LMS Rebuilt Jubilee Class.

LMS gave them the power classification 6P; this was later revised by BR to 7P."
)
)
